#ifndef _H_JSONPARSE_
#define _H_JSONPARSE_

EXTERN_C_BLOCK

/**************************************************************************
 *                         头文件引用                                     *
 **************************************************************************/
#include "defs.h"
#include "cjson_extension.h"
/**************************************************************************
 *                        常量定义                                   *
 **************************************************************************/

/**************************************************************************
 *                        宏函数定义                                 *
 **************************************************************************/

/**************************************************************************
 *                         数据类型                                    *
 **************************************************************************/
typedef struct _tagListMng
{
	INT8				*strListType;
	CJsonStructFieldDef		*ptKey;
    UINT32 uiSize;      
}T_ListJsonMng;

/**************************************************************************
 *                        全局函数                                *
 **************************************************************************/


/**********************************************************************
 * 函数名称：MediaParseListElement
 * 功能描述：解析列表元素
 * 输入参数：strListType  - 列表元素类型 strjson - JSON字符串  pData - 列表元素数据结构指针
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2022/12/27        V1.0              chengjiahao
 ***********************************************************************/
E_StateCode MediaParseListElement(INT8 *strListType, INT8 *strJson, void *pData);

/**********************************************************************
 * 函数名称：MediaMakeListElement
 * 功能描述：生成列表元素
 * 输入参数：strListType  - 列表元素类型 pData - 列表元素数据结构指针 pstrJson - JSON字符串指针
 * 输出参数：无
 * 返 回 值：    状态码
 * 其它说明：
 * 修改日期        版本号     修改人        修改内容
 * -----------------------------------------------
 * 2022/12/27        V1.0              chengjiahao
 ***********************************************************************/
E_StateCode MediaMakeListElement(INT8 *strListType, void *pData, INT8 **pstrJson);



/*private*/
E_StateCode JsonParseListElement(T_ListJsonMng *ptTable, INT8 *strListType, INT8 *strJson, void *pData);
E_StateCode JsonMakeListElement(T_ListJsonMng *ptTable, INT8 *strListType, void *pData, INT8 **pstrJson);

EXTERN_C_BLOCK_END

#endif
	

